IDEA StatiCa Open Model
IDEAProgress Constructor
Compatible with IDEA StatiCa Beta 21.0 - beta
 Constructor
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public IDEAProgress(
	Action<IDEAProgressReport> callback
)
Public Sub New (
	callback As Action(Of IDEAProgressReport)
)
public:
IDEAProgress(
	Action<IDEAProgressReport^>^ callback
)
Parameters
callback
Type: System.Action<IDEAProgressReport>
Callback function of progress
See Also
Reference
IDEAProgress Class
IdeaRS.OpenModel.Message Namespace